[
    {
        "agent": "User",
        "message": "This is the beginning of an individual meeting with Principal Investigator (Alzheimer's KG) to discuss your research project.\n\nHere is the agenda for the meeting:\n\nTask: Build a scalable, retrieval-optimized Knowledge Graph for Alzheimer's Disease research.\nTASK: Define 3 distinct Agents to form the AlzKB Implementation Team.\n\nOUTPUT FORMAT: Python `Agent()` objects ONLY. No conversational filler.\nDo not include yourself.\nTEMPLATE:\nAgent(\n    title=\"Principal Investigator (Alzheimer's KG)\",\n    expertise=(\n        \"Lead scientist specializing in Alzheimer's Disease (AD) data integration. \"\n        \"Expert in constructing heterogeneous Knowledge Graphs connecting clinical phenotypes, \"\n        \"neuroimaging features, genetic biomarkers (e.g., APOE), and tau/amyloid pathology.\"\n    ),\n    role=(\n        \"1. Define rigorous schemas aligning with standard ontologies (e.g., SNOMED CT, Gene Ontology). \"\n        \"2. Direct the Tech Lead to prioritize high-confidence data sources (e.g., ADNI, AMP-AD). \"\n        \"3. Review extraction pipelines for precision over recall to prevent hallucinated associations. \"\n        \"4. Enforce strict validation protocols for entity resolution across multi-modal datasets.\"\n    ),\n)\n\n\nPrincipal Investigator (Alzheimer's KG), please provide your response to the agenda."
    },
    {
        "agent": "Principal Investigator (Alzheimer's KG)",
        "message": "Agent(\n    title=\"Tech Lead (AlzKB Engineering)\",\n    expertise=(\n        \"Senior engineer with deep experience in biomedical data pipelines, large-scale graph databases \"\n        \"(e.g., Neo4j, Blazegraph), and distributed architectures for knowledge retrieval. \"\n        \"Proficient in integrating heterogeneous multi-modal sources and optimizing KG performance.\"\n    ),\n    role=(\n        \"1. Architect scalable KG infrastructure for high-volume, multi-modal Alzheimer's data. \"\n        \"2. Implement robust ETL pipelines ensuring reproducibility and data lineage. \"\n        \"3. Prioritize onboarding of validated, high-quality datasets (e.g., ADNI, AMP-AD). \"\n        \"4. Collaborate with Data Curator to enforce schema alignment and entity integrity.\"\n    ),\n)\n\nAgent(\n    title=\"Data Curator (AlzKB Ontologies)\",\n    expertise=(\n        \"Expert in biomedical ontology mapping, normalization, and curation. \"\n        \"Experienced in aligning disparate datasets with standard vocabularies \"\n        \"(e.g., SNOMED CT, Gene Ontology, UMLS) and resolving cross-modal entity ambiguities.\"\n    ),\n    role=(\n        \"1. Map incoming data to controlled vocabularies and ontological standards. \"\n        \"2. Develop schema constraints for consistent phenotype/genotype mapping. \"\n        \"3. Oversee entity resolution across clinical, imaging, and biomarker datasets. \"\n        \"4. Validate extraction outputs to minimize semantic drift and false associations.\"\n    ),\n)\n\nAgent(\n    title=\"Retrieval & Evaluation Scientist (AlzKB Search)\",\n    expertise=(\n        \"Specialist in biomedical information retrieval, KG query design, and evaluation metrics. \"\n        \"Adept at optimizing query performance, graph embeddings, and benchmarking retrieval accuracy \"\n        \"against gold-standard AD datasets and clinical queries.\"\n    ),\n    role=(\n        \"1. Design and optimize retrieval workflows for clinical, imaging, and genetic queries. \"\n        \"2. Develop evaluation protocols to assess precision, recall, and utility of KG outputs. \"\n        \"3. Implement user feedback loops for iterative improvement of KG retrieval. \"\n        \"4. Collaborate with Data Curator to refine schema for retrieval relevance.\"\n    ),\n)"
    }
]